# -*- coding: utf-8 -*-

from datetime import datetime
from typing import Optional
from aiogram.utils.formatting import (
    Text,
    Bold,
    Italic,
    Code,
    as_list,
    as_numbered_section,
    as_key_value,
)

# User types
user_types: dict[str, str] = {
    "unregistered": "Незарегистрированный пользователь",
    "registered": "Зарегистрированный пользователь",
    "developer": "Разработчик Телеграм-бота",
    "invite_adm": "Создатель приглашений",
    "fst_otm": "Администратор сайта ФСТ-ОТМ",
    "youtube_adm": "Администратор YouTube канала",
}

# Commands
cmd: dict[str, str] = {
    # Common buttons
    "exit": "🚪 Выход",
    # Main menu buttons
    "register": "🗝 Регистрация",
    "diag": "🛠 Диагностика",
    "invites": "🔗 Приглашения",
    "tables": "🗂 Генератор таблиц",
    "pictures": "🖼 Генератор картинок",
    "abonements": "🧗 Абонементы",
    # Register menu buttons
    "agree": "✅ Согласен",
    "disagree": "🚫 Не согласен",
    "share_phone": "☎ Отправить телефон",
    # Invites menu buttons
    "new_invite": "✨ Создать приглашение",
    "invite_history": "📅 История использования",
    # Generators menu buttons
    "all": "*️⃣ Все",
    # Abonements menu buttons
    "my_abonements": "👤 Мои абонементы",
    "new_abonement": "✨ Новый абонемент",
    "join_abonement": "👥 Подключиться",
    "minus_visit": "👣 Списать посещение",
    "plus_visit": "👣 Записать посещение",
    "visits_history": "📅 История",
    "share": "📩 Поделиться",
    "edit": "✏ Изменить",
    "unlink": "✂️ Отвязать",
    "delete": "🗑 Удалить",
    "notify_on": "✅ Уведомлять",
    "notify_off": "❎ Уведомлять",
    "back": "⬅️ Назад",
    "prev": "⏪",
    "next": "⏩",
    "yes": "✅ Да",
    "no": "🚫 Нет",
    "txt_yes": "да",
    "txt_no": "нет",
}

# Messages
msg: dict[str, str] = {
    # General messages
    "hello_bot": "Вас приветствует бот Virtual Camp!",
    "main_menu": "Вы в главном меню",
    "main_menu_exit": "Вы вышли в главное меню",
    "err_start_token": "Обработка ключа в сообщении не поддерживается",
    "err_params": "Параметры распознать не удалось",
    "no_proc": "Нет активных процессов",
    "unknown": "Сообщение не распознано",
    "none": "отсутствует",
    "unavailable": "информация недоступна",
    "example": "Пример",
    "current": "Текущее",
    "name": "Название",
    "done": "✅ Выполнено",
    "not_done": "❎ Не выполнено",
    "date_format": "ДД.ММ.ГГГГ",
    "date_time_format": "ДД.ММ.ГГГГ ЧЧ:ММ",
    "uuid_format": "xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx",
    # General help
    "start": "/start - начало работы",
    "help": "/help - показать справку",
    "skip": "/skip - оставить без изменений",
    "empty": "/empty - оставить пустым",
    "cancel": "/cancel - отменить",
    # Access control
    "no_access": "⛔️ Ошибка доступа. Возврат в главное меню",
    "access_list": "Список прав доступа",
    "m_yes": "✅ ",
    "m_no": "🚫 ",
    # Deep linking: Join abonement
    "ab_wrong_key": "Неверный ключ абонемента",
    "ab_wrong_owner": "Нельзя присоединиться к своему абонементу",
    "ab_err_joined": "Вы уже присоединены к этому абонементу",
    "ab_joined": "Вы успешно присоединились к абонементу",
    "ab_err_unknown": "Не получилось присоединиться к абонементу",
    # Deep linking: Invite user
    "invite_err_key": "Неверный ключ приглашения",
    "invite_err_joined": "Вы уже имеете эти права",
    "invite_err_unknown": "Не получилось использовали приглашение",
    "invite_ok": "Приглашение принято",
    # Abonement: top-level menu
    "abonement_main": "Работа с абонементами. Выберите действие",
    "abonement_done": "Завершение работы с абонементами. Вы в главном меню",
    # Abonement: control menu
    "ab_title": "Абонемент",
    "ab_list_empty": "✨ Абонементов нет. Создайте или присоединитесь к существующему",
    "ab_list_count": "Доступно абонементов",
    "ab_list_my": "Мои абонементы",
    "ab_list_other": "Абонементы друзей",
    "ab_visit_ask": "Проход по абонементу:",
    "ab_visit_confirm": "Подтвердить проход?",
    "ab_visit": "✅ Проход записан",
    "ab_no_visit": "❌ Проход не записан",
    "notify_on": "🔔 Уведомления включены",
    "notify_off": "🔕 Уведомления выключены",
    "ab_empty": "На абонементе не осталось проходов",
    "ab_left_visits": "Осталось проходов",
    "ab_total_visits": "Всего проходов",
    "ab_unlim": "без ограничений",
    "ab_key": "Ключ",
    "ab_link": "Ссылка для подключения:",
    "ab_sheets": "Ссылка на Google Sheets:",
    "ab_ctrl_done": "Завершение работы с выбранным абонементом",
    "ab_ctrl_cancel": "/cancel - завершить работу с абонементами",
    "ab_unknown": "Неизвестная команда работы с абонементами",
    # Abonement: creation, editing, deleting
    "ab_edit_begin": "Редактирование абонемента",
    "ab_name_label": "Название абонемента:",
    "ab_new_name": "Введите название абонемента",
    "ab_edit_name": "Введите новое название абонемента",
    "ab_new_name_format": "Рекомендуемый формат: <Куда> на <Владелец>",
    "ab_new_wrong_name": "Неверное название абонемента",
    "ab_visits_label": "Количество посещений:",
    "ab_new_visits": "Введите количество посещений",
    "ab_zero_visits": "Чтобы не отслеживать посещения введите 0 или /empty",
    "ab_wrong_visits": "Неверное количество посещений",
    "ab_expiry_date_label": "Срок действия:",
    "ab_new_expiry_date": "Введите срок действия абонемента в формате",
    "ab_new_no_expiry_date": "/empty - без ограничений по сроку",
    "ab_wrong_expiry_date": "Неверный срок действия абонемента",
    "ab_descr_label": "Описание:",
    "ab_new_descr": "Введите описание абонемента",
    "ab_new_empty_descr": "/empty - без описания",
    "ab_new_wrong_descr": "Описание абонемента не подходит",
    "ab_new_done": "Новый абонемент создан",
    "ab_edit_done": "Абонемент изменён",
    "ab_not_del": "Абонемент не удален",
    "ab_visit_edit": "📝 Изменение даты посещения",
    "ab_visit_delete": "⚠️ Удаление посещения",
    "ab_visit_select": "Нажмите на кнопку с выбранным посещением",
    "ab_visit_not_owner": "Вы не владелец абонемента и посещение не ваше",
    "ab_visit_date": "Текущая дата",
    "ab_visit_new_date": "Задайте новую дату в формате",
    # Abonement: join using menu
    "ab_join_begin": "Подключаем существующий абонемент",
    "ab_join_key": "Введите ключ абонемента",
    "ab_wrong_key_format": "Нужен ключ абонемента. Строка в формате:",
    "ab_join_not_exist": "Абонементов с таким ключом нет",
    "ab_join_own": "Вы не можете присоединиться к своему абонементу",
    "ab_join_already": "Вы уже присоединены к этому абонементу",
    "ab_join_deleted": "Этот абонемент был удалён",
    "ab_join_ask": "Вы хотите присоединиться к абонементу?",
    "ab_wrong_yes_no": "Неверный ответ. Только Да или Нет",
    "ab_join_ok": "Присоединились. Теперь абонемент в вашем списке",
    "ab_join_no": "Не присоединились к абонементу",
    "ab_failure_callback": "Неверный ключ абонемента. Введите /cancel для выхода",
    # Abonement notifications
    "ab_notify_visit_new": "❇️ Посещение по абонементу",
    "ab_notify_visit_edit": "📝 Изменение даты посещения",
    "ab_notify_visit_delete": "⚠️ Удаление посещения",
    "ab_notify_date": "📅 Дата",
    "ab_notify_visitor": "🧗‍♂️ Посетитель",
    "ab_notify_actor": "👨‍💻 Автор",
    # Diag mode messages
    "diag_main": "Режим диагностики включен",
    "diag_sys_info": "Информация о системе",
    "diag_version": "Версия",
    "diag_state": "Режим",
    "diag_bot_info": "Информация о пользователе в aiogram",
    "diag_db_info": "Информация о пользователе в БД",
    "diag_rabbitmq_info": "Информация об очередях",
    "diag_any_msg": "Расшифровка",
    "diag_cancel": "Завершение диагностики. Вы в главном меню",
    # Registration mode messages
    "reg_main": "Регистрация нового пользователя",
    "reg_no_agree": "Нужно согласиться или отправить /cancel",
    "reg_no_phone": "Нужно по кнопке отправить контакт или /cancel",
    "reg_no_name": "Нужно отправить своё имя или /skip или /cancel",
    "reg_done": "Информация записана, спасибо!",
    "reg_unknown": "Неизвестная команда регистрации",
    # Table generation messages
    "table_main": "Генерация таблиц ФСТ-ОТМ. Выберите таблицу",
    "table_bad_task": "Задание неверное",
    "table_generating": "Генерация запущена, ждите...",
    "table_end": "Завершение генерации. Вы в главном меню",
    "table_unknown": "Неизвестная команда генерации",
    # Picture generation messages
    "pictures_main": "Генерация обложек YouTube. Выберите фоновую картинку",
    "pictures_bad_task": "Задание неверное",
    "pictures_output_type": "Формат результата",
    "pictures_as_image": "формат 🖼 картинка",
    "pictures_as_document": "формат 💾 документ",
    "pictures_output_mode": "Формат результата записан. Выберите фоновую картинку",
    "pictures_text": "Напишите текст надписи на картинке (1-2 строки)",
    "pictures_bad_text": "Нужен просто текст (1 или 2 строки) или /cancel",
    "pictures_generating": "Генерация картинки запущена, ждите...",
    "pictures_end": "Завершение генерации картинок. Вы в главном меню",
    "pictures_unknown": "Неизвестная команда генерации картинок",
    # Invites messages
    "invites_main": "Создание и просмотр приглашений. Выберите действие",
    "invites_end": "Завершение работы с приглашениями. Вы в главном меню",
    "invites_create": "Создание приглашений. Выберите целевую группу",
    "table_bad_group": "Группа неверная",
    "invites_new": "Создание приглашения для группы",
    "invites_history": "Просмотр истории приглашений",
    "invites_users": "Приглашённые пользователи",
    "invites_empty": "Приглашений нет",
    "invites_unknown": "Неизвестная команда приглашений",
}

# Help messages
help: dict[str, str] = {
    "all_cmd": "Общие команды",
    "all_start": "/start - запуск бота",
    "all_help": "/help - справка по текущему режиму",
    "all_cancel": "/cancel - выход из текущего режима",
    "my_cmd": "Вам доступны режимы",
    "my_diag": "/diag - диагностика бота",
    "my_info": "/info - текущее состояние",
    "my_register": "/register - регистрация пользователя",
    "my_register_edit": "/register - изменение данных пользователя",
    "my_invite": "/invite - создание и просмотр приглашений",
    "my_tables": "/tables - генерация таблиц ФСТ-ОТМ",
    "my_pictures": "/pictures - генерация обложек YouTube",
    "my_abonement": "/abonement - подсчет посещений абонементов",
    "diag_cmd": "Режим диагностики",
    "diag_info": "/info - информация о пользователе",
    "reg_cmd": "Режим регистрации",
    "reg_cancel": "/cancel - отменить регистрацию",
    "invites_cmd": "Режим работы с приглашениями",
    "invites_cancel": "/cancel - завершить работу с приглашениями",
    "table_cmd": "Режим генерации таблиц ФСТ-ОТМ",
    "pictures_cmd": "Режим генерации обложек для YouTube",
    "pictures_as_image": "/image - генерация в формате картинки",
    "pictures_as_document": "/document - генерация в формате документа",
    "pictures_cancel": "/cancel - отменить генерацию обложек",
    "ab_cmd": "Режим работы с абонементами",
    "ab_cancel": "/cancel - завершить работу с абонементами",
    "ab_ctrl_cmd": "Режим управления абонементами",
    "ab_ctrl_cancel": "/cancel - завершить работу с выбранным абонементом",
}

# Regular expression for UUID
re_uuid: str = r"^[a-f0-9]{8}-[a-f0-9]{4}-[a-f0-9]{4}-[a-f0-9]{4}-[a-f0-9]{12}$"

# Date and time formats
date_fmt: str = "%d.%m.%Y"
date_h_m_fmt: str = "%d.%m.%Y %H:%M"
date_h_m_s_fmt: str = "%d.%m.%Y %H:%M:%S"

# Register new user: begin
reg_main: Text = as_list(
    Bold("Регистрация нового пользователя"),
    "",
    as_numbered_section(
        "Нужно будет:",
        "Поделиться номером телефона (он будет скрыт)",
        "Ввести своё имя (будет видно пользователям)",
    ),
    "",
    "Продолжая, Вы соглашаетесь на обработку предоставленных Вами персональных данных.",
)

# Register new user: begin edit
reg_main_edit: Text = as_list(
    Bold("Обновление данных пользователя"),
    "",
    as_numbered_section(
        "Можно изменить:",
        "Номер телефона (он будет скрыт)",
        "Своё имя (будет видно пользователям)",
    ),
    "",
    msg["skip"],
)

# Register new user: ask phone
reg_phone: Text = as_list(
    Bold("Отправьте свой номер телефона"),
    "",
    "Пожалуйста, не отправляйте его текстом!",
    "Надо поделиться своим контактом.",
    "",
    Bold("Для этого нажмите кнопку ниже"),
)


# Register new user: ask name
def reg_name(currentName: Optional[str]) -> Text:
    res = as_list(
        Bold("Введите имя"),
        "Это имя будет видно другим пользователям.",
        as_key_value("Текущее имя", currentName) if currentName else "",
        msg["skip"],
    )
    return res


# Register new user: end
reg_end: Text = as_list("Завершение регистрации.", "", "Вы в главном меню")


# Abonement: info
def ab_info(
    name: str,
    description: Optional[str],
    expiry_date: Optional[datetime],
    total_visits: int,
    visits_count: int,
    my_visits_count: int,
    notify: Optional[str],
) -> Text:
    days = expiry_date.date() - datetime.now().date() if expiry_date else None
    days_left = days.days + 1 if days is not None else None
    days_left_str = ""
    if days_left is not None:
        if days_left > 1:
            days_left_str = f"Дней осталось: {days_left}"
        elif days_left == 1:
            days_left_str = "Сегодня последний день"
        else:
            days_left_str = "Просроченный"
    res = as_list(
        "Выбран абонемент",
        Bold(name),
        *[Italic(description), ""] if description else [""],
        (
            f"До {expiry_date.strftime(date_fmt)}"
            if expiry_date
            else Text(msg["ab_expiry_date_label"], " ", msg["ab_unlim"])
        ),
        *([days_left_str, ""] if days_left_str else [""]),
        (
            f"На {total_visits} посещений"
            if total_visits != 0
            else Text(msg["ab_visits_label"], " ", msg["ab_unlim"])
        ),
        as_key_value("Совершено проходов", visits_count),
        as_key_value("Из них мои проходы", my_visits_count),
        *(
            [
                as_key_value(
                    msg["ab_left_visits"],
                    total_visits - visits_count,
                ),
                "",
            ]
            if total_visits != 0
            else [""]
        ),
        msg["notify_on"] if notify and notify == "all" else msg["notify_off"],
    )
    return res


# Abonement: page with visits
def ab_page(offset: int, total: int, visits: int) -> Text:
    res = (
        Text(
            "📈 Проходы с ",
            Bold(offset + 1),
            " по ",
            Bold(offset + visits),
            " из ",
            Bold(total),
        )
        if total > 0
        else Text("✨ Проходов пока не было.")
    )
    return res


# Abonement Visit: ask to delete or unlink
def ab_del_visit_ask() -> Text:
    res = as_list(
        Text("Отправьте ", Bold(cmd["txt_yes"]), " чтобы удалить посещение"),
        "",
        "/cancel - отменить удаление посещения",
    )
    return res


# Abonement: ask to delete or unlink
def ab_del_ask(user_is_owner: bool, name: str) -> Text:
    res = as_list(
        ("🗑 Удаление абонемента" if user_is_owner else "⚠️ Отключение абонемента"),
        as_key_value(msg["name"], name),
        "",
        Text(
            "Отправьте ",
            Bold(cmd["txt_yes"]),
            " в ответ, если хотите ",
            (Bold("удалить") if user_is_owner else Bold("отключить")),
            " его",
        ),
        "",
        "/cancel - отменить удаление абонемента",
    )
    return res


# Abonement: delete or unlink result
def ab_del(
    operation: Optional[str], result: bool, abonement_key: Optional[str]
) -> Text:
    res = as_list(
        Text(
            "Абонемент",
            Bold(" не") if not result else "",
            " удален" if operation and operation == "delete" else " отключен",
        ),
        "",
        as_key_value(
            "Ключ",
            Code(abonement_key) if abonement_key else Italic("неизвестен"),
        ),
    )
    return res
